{
  "at_will_employment": {
    "category": "employment_terms",
    "title": "At-Will Employment",
    "variations": {
      "default": {
        "title": "Standard At-Will",
        "clause": "Employee's employment with the Company is at-will. This means that either Employee or the Company may terminate the employment relationship at any time, for any or no reason, with or without cause or advance notice. This at-will relationship cannot be modified or altered except by a written agreement signed by the Employee and an authorized officer of the Company."
      },
      "with_cause_examples": {
        "title": "At-Will with 'For Cause' Examples",
        "clause": "Employee's employment with the Company is at-will. This means that either Employee or the Company may terminate the employment relationship at any time, for any or no reason, with or without cause or advance notice. For illustrative purposes, 'Cause' for termination may include, but is not limited to: (i) conviction of a felony; (ii) gross negligence or willful misconduct in the performance of duties; (iii) material breach of this Agreement or Company policies. This at-will relationship cannot be modified or altered except by a written agreement signed by the Employee and an authorized officer of the Company."
      }
    }
  },
  "compensation": {
    "category": "compensation",
    "title": "Compensation",
    "variations": {
      "default": {
        "title": "Standard Compensation",
        "clause": "Employee shall receive a base salary of ${{annual_salary}} per year, payable in accordance with the Company's standard payroll practices. Employee's position is classified as {{overtime_status}} for purposes of federal and state wage and hour laws."
      }
    }
  },
  "ip_assignment": {
    "category": "intellectual_property",
    "title": "Intellectual Property Assignment",
    "variations": {
      "default": {
        "title": "Standard IP Assignment",
        "clause": "Employee agrees to assign to the Company all rights, title, and interest in and to any and all inventions, original works of authorship, developments, concepts, improvements, or trade secrets, whether or not patentable or registrable under copyright or similar laws, which Employee may solely or jointly conceive or develop or reduce to practice, or cause to be conceived or developed or reduced to practice, during the period of employment with the Company. This assignment is subject to the limitations of California Labor Code ยง 2870, a copy of which is attached as Exhibit A."
      }
    }
  },
  "arbitration": {
    "category": "dispute_resolution",
    "title": "Arbitration Agreement",
    "variations": {
      "none": {
        "title": "No Arbitration Clause",
        "clause": ""
      },
      "jams_provider": {
        "title": "Arbitration via JAMS",
        "clause": "Any dispute, claim or controversy arising out of or relating to this Agreement or the breach, termination, enforcement, interpretation or validity thereof, including the determination of the scope or applicability of this agreement to arbitrate, shall be determined by arbitration in {{arbitration_county}} County, California before one arbitrator. The arbitration shall be administered by JAMS pursuant to its Employment Arbitration Rules and Procedures. This clause shall not preclude parties from seeking provisional remedies in aid of arbitration from a court of appropriate jurisdiction."
      },
      "aaa_provider": {
        "title": "Arbitration via AAA",
        "clause": "Any dispute, claim or controversy arising out of or relating to this Agreement or the breach, termination, enforcement, interpretation or validity thereof, including the determination of the scope or applicability of this agreement to arbitrate, shall be determined by arbitration in {{arbitration_county}} County, California before one arbitrator. The arbitration shall be administered by the American Arbitration Association (AAA) under its Employment Arbitration Rules. This clause shall not preclude parties from seeking provisional remedies in aid of arbitration from a court of appropriate jurisdiction."
      }
    }
  },
  "class_action_waiver": {
    "category": "dispute_resolution",
    "title": "Class Action Waiver",
    "variations": {
      "none": {
        "title": "No Waiver",
        "clause": ""
      },
      "default": {
        "title": "Standard Class Action Waiver",
        "clause": "To the extent permitted by law, Employee and the Company agree that any dispute resolution proceedings will be conducted only on an individual basis and not in a class, consolidated or representative action. This waiver does not apply to representative claims brought under the Private Attorneys General Act (PAGA)."
      }
    }
  },
  "confidentiality": {
    "category": "intellectual_property",
    "title": "Confidentiality",
    "variations": {
      "default": {
        "title": "Standard Confidentiality",
        "clause": "Employee agrees to maintain in strict confidence and not to use or disclose, except as required in the performance of Employee's duties, any of the Company's Confidential Information. 'Confidential Information' includes trade secrets, customer lists, marketing strategies, and any other proprietary information of the Company."
      }
    }
  },
  "governing_law": {
    "category": "general_provisions",
    "title": "Governing Law and Jurisdiction",
    "variations": {
      "default": {
        "title": "Standard Governing Law",
        "clause": "This Agreement shall be governed by and construed in accordance with the laws of the State of California, without regard to its conflict of laws principles. Any legal action or proceeding arising under this Agreement will be brought exclusively in the federal or state courts located in {{governing_law_county}} County, California, and the parties hereby irrevocably consent to the personal jurisdiction and venue therein."
      }
    }
  },
  "entire_agreement": {
    "category": "general_provisions",
    "title": "Entire Agreement",
    "variations": {
      "default": {
        "title": "Standard Entire Agreement",
        "clause": "This Agreement, including Exhibit A, constitutes the entire agreement between the parties with respect to the subject matter hereof and supersedes all prior oral and written agreements, understandings and communications."
      }
    }
  },
  "severability": {
    "category": "general_provisions",
    "title": "Severability",
    "variations": {
      "default": {
        "title": "Standard Severability",
        "clause": "If any provision of this Agreement is held to be invalid or unenforceable, the remaining provisions shall continue to be valid and enforceable."
      }
    }
  }
}
